package by.htp.les100.main;

//  Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника

public class Zadanie7 {

	public static void main(String[] args) {
		
		double s;
		double d;
		 
		d = 7.0;
		
		s = d * (d / 2);
		
		System.out.println("s = " + s );
		
	}

}
